#pragma once

namespace nature
{
	/**
	*	细胞与细胞之间存在着细胞间质( Interstitial substance)。
	*	人体组织内的细胞都浸润在细胞间质液中。
	*	细胞间质的多少与细胞间的密集程度有关。
	*	如上皮组织细胞的细胞间质最少，结缔组织细胞的细胞间质较多。
	*	细胞间质就是细胞之间的物质，也就是在细胞之间存在的一种或几种与细胞不同的APSC多能细胞等物质。
	*	细胞间质存在于细胞膜和细胞之间。
	*
	*	细胞间质是由细胞产生的不具有细胞形态和结构的物质，它包括纤维、基质和流体物质（组织液、淋巴液、血浆等）。
	*
	*	细胞间质对细胞起着支持、保护、连结和营养作用，参与构成细胞生存的微环境(microenvironment)。
	*	细胞间质是人体细胞所生活的液体环境。
	*	细胞间质液含有细胞在代谢时所需要的全部物质。
	*	同样的，细胞间质液也会接受细胞的代谢产物，或未被利用的物质。
	*	细胞和液体之间不断地进行着物质交换：吸取氧和养料，排出二氧化碳等废物。
	*	为了不使细胞本身被产生的废物所破坏，细胞间质液会不断地更新。
	*	通俗的说，细胞间质就是细胞之间的物质，也就是在细胞之间存在的一种或几种与细胞不同的物质
	*/
	class NInterstitialSubstance
	{
	public:
	protected:
	private:
	};
}